data/collected_data/orange/api/standarda8v2/e/load_compose.txt
Running 30m test @ http://20.117.70.94:60/wrk2-api/post/compose
  2 threads and 1000 connections
  Thread calibration: mean lat.: 3085.428ms, rate sampling interval: 10764ms
  Thread calibration: mean lat.: 3370.377ms, rate sampling interval: 11804ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.46m     7.30m   25.39m    58.67%
    Req/Sec    68.03      5.47    82.00     80.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.43m 
 75.000%   18.56m 
 90.000%   22.68m 
 99.000%   25.39m 
 99.900%   26.02m 
 99.990%   26.39m 
 99.999%   26.67m 
100.000%   26.74m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2265.087     0.000000            1         1.00
  147455.999     0.100000        24515         1.11
  293601.279     0.200000        49067         1.25
  436469.759     0.300000        73546         1.43
  588775.423     0.400000        98134         1.67
  745537.535     0.500000       122598         2.00
  825229.311     0.550000       134863         2.22
  903348.223     0.600000       147117         2.50
  976748.543     0.650000       159420         2.86
 1044905.983     0.700000       171627         3.33
 1113587.711     0.750000       183964         4.00
 1150287.871     0.775000       190050         4.44
 1190133.759     0.800000       196259         5.00
 1232076.799     0.825000       202331         5.71
 1275068.415     0.850000       208492         6.67
 1318060.031     0.875000       214576         8.00
 1339031.551     0.887500       217627         8.89
 1361051.647     0.900000       220746        10.00
 1382023.167     0.912500       223813        11.43
 1401946.111     0.925000       226778        13.33
 1422917.631     0.937500       229916        16.00
 1433403.391     0.943750       231425        17.78
 1443889.151     0.950000       232898        20.00
 1455423.487     0.956250       234505        22.86
 1465909.247     0.962500       235980        26.67
 1478492.159     0.968750       237618        32.00
 1483735.039     0.971875       238281        35.56
 1490026.495     0.975000       239086        40.00
 1496317.951     0.978125       239825        45.71
 1503657.983     0.981250       240660        53.33
 1509949.439     0.984375       241357        64.00
 1513095.167     0.985938       241733        71.11
 1517289.471     0.987500       242141        80.00
 1521483.775     0.989062       242511        91.43
 1525678.079     0.990625       242872       106.67
 1530920.959     0.992188       243279       128.00
 1533018.111     0.992969       243468       142.22
 1535115.263     0.993750       243610       160.00
 1538260.991     0.994531       243836       182.86
 1541406.719     0.995313       244036       213.33
 1544552.447     0.996094       244238       256.00
 1545601.023     0.996484       244305       284.44
 1547698.175     0.996875       244426       320.00
 1548746.751     0.997266       244474       365.71
 1550843.903     0.997656       244575       426.67
 1553989.631     0.998047       244683       512.00
 1555038.207     0.998242       244723       568.89
 1556086.783     0.998437       244765       640.00
 1557135.359     0.998633       244805       731.43
 1559232.511     0.998828       244857       853.33
 1561329.663     0.999023       244909      1024.00
 1562378.239     0.999121       244931      1137.78
 1563426.815     0.999219       244954      1280.00
 1564475.391     0.999316       244977      1462.86
 1566572.543     0.999414       245005      1706.67
 1568669.695     0.999512       245030      2048.00
 1569718.271     0.999561       245042      2275.56
 1570766.847     0.999609       245047      2560.00
 1571815.423     0.999658       245057      2925.71
 1573912.575     0.999707       245071      3413.33
 1574961.151     0.999756       245083      4096.00
 1576009.727     0.999780       245088      4551.11
 1578106.879     0.999805       245097      5120.00
 1579155.455     0.999829       245101      5851.43
 1581252.607     0.999854       245111      6826.67
 1581252.607     0.999878       245111      8192.00
 1583349.759     0.999890       245115      9102.22
 1584398.335     0.999902       245120     10240.00
 1584398.335     0.999915       245120     11702.86
 1585446.911     0.999927       245123     13653.33
 1588592.639     0.999939       245127     16384.00
 1588592.639     0.999945       245127     18204.44
 1590689.791     0.999951       245130     20480.00
 1590689.791     0.999957       245130     23405.71
 1594884.095     0.999963       245135     27306.67
 1594884.095     0.999969       245135     32768.00
 1594884.095     0.999973       245135     36408.89
 1594884.095     0.999976       245135     40960.00
 1594884.095     0.999979       245135     46811.43
 1595932.671     0.999982       245136     54613.33
 1596981.247     0.999985       245137     65536.00
 1596981.247     0.999986       245137     72817.78
 1600126.975     0.999988       245139     81920.00
 1600126.975     0.999989       245139     93622.86
 1600126.975     0.999991       245139    109226.67
 1600126.975     0.999992       245139    131072.00
 1600126.975     0.999993       245139    145635.56
 1600126.975     0.999994       245139    163840.00
 1600126.975     0.999995       245139    187245.71
 1600126.975     0.999995       245139    218453.33
 1604321.279     0.999996       245140    262144.00
 1604321.279     1.000000       245140          inf
#[Mean    =   747645.057, StdDeviation   =   437726.985]
#[Max     =  1603272.704, Total count    =       245140]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  246354 requests in 30.00m, 50.76MB read
  Socket errors: connect 0, read 776, write 12370, timeout 776954
  Non-2xx or 3xx responses: 40603
Requests/sec:    136.86
Transfer/sec:     28.87KB